Documents/_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>_Заявка</Name>
			<BasedOn>
				<xr:Item>Document._Заявка</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВОтчетСогласованныеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаУНас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначенаНа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef._СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техподдержка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДПисьма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВхИсх</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийHTML</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатьОписания</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Роли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановыеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьЧекЛисты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвтоНачисление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланОтветственный</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланСотрудник</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаписиRM</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотрено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаВВыходные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стадия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._СтадииРазработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef._СтатусыЧЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыКлиенту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПлановые</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗадание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеHTML</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/_СтатусыЧЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>_СтатусыЧЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/_Заявка/Forms/ФормаДокументаНовая/Ext/Form/Module.bsl
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
    
    Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка._КонтактныеЛица") Тогда
        Объект.КонтактноеЛицо = ВыбранноеЗначение;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура Отправить(ВыбранноеЗначение,ТекущаяСтрока)
    
    строка = объект.Комментарии.НайтиПоИдентификатору(ТекущаяСтрока);
    Получатели  = новый Массив;
    для Каждого  стр из ВыбранноеЗначение цикл
        Если стр.Пометка тогда
            Адрес = стр.Значение.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
            Если Адрес = Неопределено тогда 
                Продолжить; 
            КонецЕсли;
            адрес = Адрес.Представление ;
            Получатели.Добавить(Адрес); 
        КонецЕсли;
    КонецЦикла;
    
    результат  =  ОтправитьПисьмо("Комментарий к задаче " + объект.Номер + " от " + Формат(строка.Дата,"ДФ=dd.MM.yy") ,?(строка.КомментарийHTML_ = Неопределено,строка.Комментарий,строка.КомментарийHTML_ ),Получатели );
    
    Если не результат.результат тогда 
        Сообщить(результат.Ошибка); 
    КонецЕсли;
    
КонецПроцедуры
// Параметры
//	- Тема (строка)
//	- ТекстHTML (строка, форматированный документ)
//	- МассивПолучателей (массив строк)
//	- Вложения (массив структур:	- Данные (строка, картинка, двоичные данные)
//									- ИмяФайла (строка))
// Возвращаемое значение
//	Структура:
//	- Результат (булево)
//	- Ошибка (строка)
Функция ОтправитьПисьмо(Тема, ТекстHTML, Получатели, Вложения = Неопределено, УчетнаяЗаписьЭП = Неопределено, Важность = Неопределено, Кодировка = Неопределено) Экспорт
    
    Попытка
        
        Если УчетнаяЗаписьЭП = Неопределено Тогда
            УчетнаяЗаписьЭП = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
        КонецЕсли;
        
        Если Важность = Неопределено Тогда
            Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
        КонецЕсли;
        
        Если Кодировка = Неопределено Тогда
            Кодировка = "windows-1251";
        КонецЕсли;
        
        Если Вложения = Неопределено Тогда
            Вложения = Новый Массив;
        КонецЕсли;
        
        Текст = ТекстHTML;
        ВложенияФорматированногоДокумента = Новый Структура;
        
        Если ТипЗнч(ТекстHTML) = Тип("ФорматированныйДокумент") Тогда
            ТекстHTML.ПолучитьHTML(Текст, ВложенияФорматированногоДокумента);
        ИначеЕсли ЭтоАдресВременногоХранилища(ТекстHTML) тогда
            Попытка
                стр =  ПолучитьИзВременногоХранилища(ТекстHTML) ;
                Текст = стр.тест;
                ВложенияФорматированногоДокумента = стр.влож;
            Исключение
            КонецПопытки;
        КонецЕсли;
        
        Письмо = Новый ИнтернетПочтовоеСообщение;
        Письмо.Важность = Важность;
        Письмо.Кодировка = Кодировка;
        Письмо.ИмяОтправителя = УчетнаяЗаписьЭП.ИмяПользователя;
        Письмо.Отправитель = УчетнаяЗаписьЭП.АдресЭлектроннойПочты; 
        Письмо.Тема = Тема;
        Для Каждого Получатель Из Получатели Цикл
            Письмо.Получатели.Добавить(Получатель);
        КонецЦикла;
        Для Каждого Вложение Из Вложения Цикл
            Данные = Вложение.Данные;
            Если ТипЗнч(Данные) = Тип("Картинка") Тогда
                Данные = Данные.ПолучитьДвоичныеДанные();
            КонецЕсли;
            Письмо.Вложения.Добавить(Данные, Вложение.ИмяФайла);		
        КонецЦикла;
        Для Каждого Картинка Из ВложенияФорматированногоДокумента Цикл
            Вложение = Письмо.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
            Вложение.Идентификатор = Картинка.Ключ;
            Текст = СтрЗаменить(Текст, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
        КонецЦикла;
        Письмо.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.HTML); 	
        
        
        Почта = Новый ИнтернетПочта;
        
        //ПочтовыйПрофиль = СформироватьИнтернетПрофиль(УчетнаяЗаписьЭП);
        ПочтовыйПрофиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭП);
        
        Почта.Подключиться(ПочтовыйПрофиль);
        Почта.Послать(Письмо);
        Почта.Отключиться();
        
        Возврат Новый Структура("Результат, Ошибка", Истина, ""); 
        
    Исключение
        Возврат Новый Структура("Результат, Ошибка", Ложь, ОписаниеОшибки());
    КонецПопытки;
    
КонецФункции


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    Если тип("ФормаКлиентскогоПриложения")= ТипЗнч(ИсточникВыбора) и 
        (ИсточникВыбора.ИмяФормы = "Обработка._РабочийСтол_Заявки.Форма.СозданиеЗадания" или ИсточникВыбора.ИмяФормы = "Задача._ИсполнениеЗадач.Форма.ФормаЗадачи") тогда
        Прочитать();
    иначе
        Если ТипЗнч(ВыбранноеЗначение) = тип("СписокЗначений") тогда
            
            Отправить(ВыбранноеЗначение, Элементы.Комментарии.ТекущаяСтрока);
            
        ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = тип("ФорматированныйДокумент") тогда
            
            Модифицированность = Истина;
            Элементы.Комментарии.ТекущиеДанные.КомментарийHTML_ = ПоместитьВоВременноеХранилище(ВыбранноеЗначение,УникальныйИдентификатор);
            Элементы.Комментарии.ТекущиеДанные.Комментарий = ВыбранноеЗначение.ПолучитьТекст();
            
        ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = тип("Структура") тогда
            
            Модифицированность = Истина;
            Если не  Элементы.Комментарии.ТекущиеДанные = Неопределено тогда
                Элементы.Комментарии.ТекущиеДанные.КомментарийHTML_ = ПоместитьВоВременноеХранилище(ВыбранноеЗначение,УникальныйИдентификатор);
                Элементы.Комментарии.ТекущиеДанные.Комментарий = ВыбранноеЗначение.мОписание;
            КонецЕсли;
            
            КомментарииПриАктивизацииСтроки(Неопределено);
            
        иначе
            
            ОбработкаВыбораНаСервере(ВыбранноеЗначение);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ФильтрЧЛПриИзмененииНаСервере()
    
    Если ФильтрЧЛ тогда
        Элементы.ЧекЛисты.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Перечисления._СтатусыЧЛ.Создано);
    иначе
        Элементы.ЧекЛисты.ОтборСтрок= Новый ФиксированнаяСтруктура("Статус");
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЧЛПриИзменении(Элемент)
    
    ФильтрЧЛПриИзмененииНаСервере();
    
КонецПроцедуры

&НаСервере
//Процедура ПолучитьСообщенияНаСервере()
//    
//    Если не СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда    
//        Возврат 
//    КонецЕсли;
//    
//    попытка	
//        Если Модифицированность тогда
//            УстановитьПривилегированныйРежим(Истина);
//            ИдентификаторПользователяСВ = ПолучитьИдентификаторНаСервере(Объект.Ссылка);
//            
//            
//            ОбсуждениеСВ = СистемаВзаимодействия.ПолучитьОбсуждение(строка(объект.Ссылка.УникальныйИдентификатор())); 
//            Если ОбсуждениеСВ = неопределено тогда
//                ОбсуждениеСВ = СистемаВзаимодействия.СоздатьОбсуждение();
//                ОбсуждениеСВ.Ключ = объект.Ссылка.УникальныйИдентификатор();
//                КонтекстОбсужденияСВ = Новый КонтекстОбсужденияСистемыВзаимодействия( ПолучитьНавигационнуюСсылку(Объект.Ссылка)); // работает только в 8.3.11???  .ПолучитьОбъект()
//                //	ОбсуждениеСВ.КонтекстОбсуждения = КонтекстОбсужденияСВ; 
//                ОбсуждениеСВ.Отображаемое = Истина;
//                //КонтекстОбсужденияСВ = Новый КонтекстОбсужденияСистемыВзаимодействия(ПолучитьНавигационнуюСсылку(Объект.НавСсылка.ПолучитьОбъект())); // работает только в 8.3.11???  Об
//                ОбсуждениеСВ.Заголовок = "Задача "+объект.Номер;
//            КонецЕсли;
//            
//            Если не ОбсуждениеСВ.Участники.Содержит(СистемаВзаимодействия.ИдентификаторТекущегоПользователя()) Тогда
//                ОбсуждениеСВ.Участники.Добавить( СистемаВзаимодействия.ИдентификаторТекущегоПользователя()); 
//            КонецЕсли;
//            
//            
//            Для каждого Стр Из ИдентификаторПользователяСВ Цикл
//                Если Стр.UID <> неопределено  и Стр.UID <>  СистемаВзаимодействия.ИдентификаторТекущегоПользователя() тогда
//                    Если не ОбсуждениеСВ.Участники.Содержит(Стр.UID) Тогда
//                        ОбсуждениеСВ.Участники.Добавить( Стр.UID); 
//                    КонецЕсли;
//                КонецЕсли;
//            КонецЦикла;
//            ОбсуждениеСВ.Записать();
//            
//            
//            Сообщение = СистемаВзаимодействия.СоздатьСообщение(ОбсуждениеСВ.Идентификатор); 
//            Сообщение.Текст = "Для вас создана или изменена  задача "+Объект.Ссылка;
//            
//            Для каждого Стр Из ИдентификаторПользователяСВ Цикл
//                Если Стр.UID <> неопределено  и Стр.UID <>  СистемаВзаимодействия.ИдентификаторТекущегоПользователя() тогда
//                    Сообщение.Получатели.Добавить(Стр.UID);
//                КонецЕсли;
//            КонецЦикла;     
//            Сообщение.Записать()
//            
//        КонецЕсли;	
//        
//        
//    Исключение
//        
//    КонецПопытки; 
//КонецПроцедуры // 

&НаСервере
Функция ПолучитьИдентификаторНаСервере(Док)
    
    ТЗ =  Новый ТаблицаЗначений;
    Тз.Колонки.Добавить("UID");
    
    для Каждого ВыборкаДетальныеЗаписи из Док.Смета цикл 
        Стр = ТЗ.Добавить();
        Попытка
            Стр.UID = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ВыборкаДетальныеЗаписи.Сотрудник.ИдентификаторПользователяИБ);//ВыборкаДетальныеЗаписи.Пользователь.УникальныйИдентификатор();
        Исключение
        КонецПопытки;
    КонецЦикла;
    
    возврат ТЗ;
    
КонецФункции 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    
    //ПолучитьСообщенияНаСервере(); 
    ПриЧтенииНаСервере(ТекущийОбъект)
    
КонецПроцедуры

&НаКлиенте
Процедура НаУточнение(Команда)
    
    объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.НаУточнении");
    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
    
    Если не ЗначениеЗаполнено(Объект.Ссылка) тогда
        Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
    иначе
        Элементы.ГруппаСтаница.ТекущаяСтраница = Элементы.ГруппаЧекЛисты;
    КонецЕсли;
    УсловноеОформление(Объект);
    
КонецПроцедуры
&НаСервере
Процедура УсловноеОформление(ТекущийОбъект)
    
    //инфо надписи  
    ИзменениеЗапрещено                              = ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ._Заявка",ТекущийОбъект.Ссылка);
    Элементы.ИнфоДатаЗапрета.Видимость              = ИзменениеЗапрещено;
    Элементы.ИнфоКонтрагентЗаблокирован.Видимость   = ТекущийОбъект.Контрагент.Блокировка;
    Элементы.ПеренестиНеЗакрытыеЗадачи.Видимость    = ТекущийОбъект.Техподдержка и (ТекущийОбъект.статус = Перечисления._СтатусыЗаявки.Выполнена  или ТекущийОбъект.статус = Перечисления._СтатусыЗаявки.ПереданоВТестирование );
      
    Элементы.ЕстьНевыставленные.Видимость           = ЕстьНевыставленные;
    Элементы.ПеренестиВсеНевыставленнеыЧасыИзЗадач.Видимость           = ЕстьНевыставленные;
 
    Если РольДоступна("ПолныеПрава") тогда
        Возврат;
    КонецЕсли;
    
    
    Элементы.Техподдержка.Доступность               = Ложь;
    Элементы.Проверена.Доступность                  = РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    Элементы.ДатаАкта.Доступность                   = РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    Элементы.ЧекЛистыОтветственный.Доступность      = РольДоступна("_ИзменениеОтветственногоВЗадачах");
    Элементы.ПеренестиНеЗакрытыеЗадачи.Доступность  = РольДоступна("_СервисИнженер") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    
    ТолькоПросмотр =  (ТекущийОбъект.Контрагент.Блокировка 
    или ТекущийОбъект.Проверена   или ИзменениеЗапрещено ) и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок")//кто ставит выполенено пусть меняет заявку дальше 
    ;
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    если объект.Коментарий = "###Создано_Копированием_Отказать###" тогда
        Отказ = Истина;
    КонецЕсли;
    
    
    ПриОткрытииНаСервере();
    ОбновитьсписокПодчиненности()   ;
    
    Экран = ПолучитьИнформациюЭкрановКлиента()[0];
    Если Экран.Ширина < 1920  тогда 
        ЭтаФорма.Масштаб = 80 ;    
    иначе
        Масштаб = 100;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура КомментарииПередНачаломИзменения(Элемент, Отказ)
    
    Если 	Элементы.Комментарии.ТекущиеДанные = Неопределено тогда 
        возврат 
    КонецЕсли;
    Отказ = Элементы.Комментарии.ТекущиеДанные.Защищена ;
    
КонецПроцедуры

&НаКлиенте
Процедура КомментарииПередУдалением(Элемент, Отказ)
    
    Если 	Элементы.Комментарии.ТекущиеДанные = Неопределено тогда 
        возврат 
    КонецЕсли;
    Отказ = Элементы.Комментарии.ТекущиеДанные.Защищена;
    
КонецПроцедуры

&Насервере 
Функция  ТекущийПользователь()
    
    Возврат ПараметрыСеанса.ТекущийПользователь;
    
КонецФункции

&Насервере 
Функция  РольДоступна1(Роль)
    
    Возврат РольДоступна(Роль);
    
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Для  Каждого стр из объект.ЧекЛисты цикл
        стр.Защищена = Истина;
    КонецЦикла;
    Для  Каждого стр из объект.Комментарии цикл
        стр.Защищена = Истина;
    КонецЦикла;
    
    ЕстьНевыставленные =  Ложь;
    
    Если  РольДоступна("ПолныеПрава")  или РольДоступна("_СервисИнженер") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок") тогда
        РеквизитФормыВЗначение("Объект").ПроверитьНевыставленныеЧасы(ЕстьНевыставленные) ;
    КонецЕсли;
    
    
    для Каждого стр из Объект.Комментарии цикл
            Дхр = ТекущийОбъект.Комментарии[стр.НомерСтроки-1].КомментарийHTML.Получить();
        стр.КомментарийHTML_ =  ?(тип("Структура") = ТипЗнч(дхр), ПоместитьВоВременноеХранилище(дхр, УникальныйИдентификатор),дхр);
    КонецЦикла;
    //ШаблонРассылки = ТекущийОбъект.Шаблон.Получить(); 	
    УсловноеОформление(ТекущийОбъект);
    
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если объект.Проверена и не объект.Ссылка.Проверена тогда
        объект.ДатаЗакрытия = ТекущаяДата();
    КонецЕсли;
    
    Если ПереноситьЗадачиНеЗакрытые тогда
        ТекущийОбъект.ДополнительныеСвойства.Вставить("ПереноситьЗадачиНеЗакрытые");
    КонецЕсли;
    
    для Каждого стр из ТекущийОбъект.Комментарии цикл
        Дхр = ?(ЭтоАдресВременногоХранилища(Объект.Комментарии[стр.НомерСтроки-1].КомментарийHTML_), ПолучитьИзВременногоХранилища(Объект.Комментарии[стр.НомерСтроки-1].КомментарийHTML_),Объект.Комментарии[стр.НомерСтроки-1].КомментарийHTML_);
        стр.КомментарийHTML = Новый ХранилищеЗначения( Дхр);
    КонецЦикла;
    //ТекущийОбъект.Шаблон = Новый ХранилищеЗначения(ШаблонРассылки, Новый СжатиеДанных(8));
    
    Оповещения(ТекущийОбъект);
    
КонецПроцедуры


&НаКлиенте
Процедура ЧекЛистыПередУдалением(Элемент, Отказ)
    
    для Каждого стр из Элементы.ЧекЛисты.ВыделенныеСтроки   Цикл 
        ТД = Объект.ЧекЛисты.НайтиПоИдентификатору(стр);
        Отказ = НельзяУдалить(ТД);     
        Если  Отказ тогда
            Сообщить("в выделенных строках присутствуют строки которые нельзя удалить");
            Прервать;
        КонецЕсли;
    КонецЦикла;         

КонецПроцедуры
&НаКлиенте
Функция НельзяУдалить (ТД)
    
    
    //либо полные права
    //либо нельзя если:
    //дата запрета
    //если защищена и ты удаляешь чужой лист 
    
    Возврат   ?(РольДоступна1("ПолныеПрава") или  РольДоступна1("_ИзменениеВыполненныхПроверенныхЗаявок"),Ложь,
    ТД.ЭтоЗадание 
    или ТД.ДействуетДатаЗапрета  
    или ТД.Защищена и не ТекПольз() = ТД.Сотрудник   )
    или ЗначениеЗаполнено(ТД.НомерЗаписиRM)
    или ЗначениеЗаполнено(ТД.КодСтроки) и ЗначениеЗаполнено(ТД.Задача);
    
КонецФункции

&НаКлиенте
Процедура ЧекЛистыПриАктивизацииСтроки(Элемент)

    Если Элементы.ЧекЛисты.ТекущиеДанные = Неопределено тогда 
        возврат 
    КонецЕсли;
    
    ТД = Элементы.ЧекЛисты.ТекущиеДанные;
    Элементы.Удалить.Доступность = не НельзяУдалить(ТД) ;
    НеБитаяСсылка = НеБитаяСсылка(ТД.Задача);
    
    
    Элементы.РедактированиеИзRM.Видимость = ЗначениеЗаполнено(ТД.НомерЗаписиRM);
    Элементы.РедактированиеИзЗадачи.Видимость = ЗначениеЗаполнено(ТД.КодСтроки)  и ЗначениеЗаполнено(ТД.Задача) и НеБитаяСсылка;
    
    Элементы.ГруппаРедактированиеСтрокиЧекЛиста.ТолькоПросмотр = ТД.ДействуетДатаЗапрета 
    или ЗначениеЗаполнено(ТД.КодСтроки)и НеБитаяСсылка и ЗначениеЗаполнено(ТД.Задача)
    или  ЗначениеЗаполнено(ТД.НомерЗаписиRM);
    
    
    
    Элементы.ГруппаРедактированиеСтрокиЧекЛиста.ТолькоПросмотр = ТД.ДействуетДатаЗапрета 
    или ЗначениеЗаполнено(ТД.КодСтроки) и ЗначениеЗаполнено(ТД.Задача) и НеБитаяСсылка 
    или  ЗначениеЗаполнено(ТД.НомерЗаписиRM);
    
    Элементы.ПеренестиВыделенныеЧЛВЗаявку.Доступность = не Элементы.ГруппаРедактированиеСтрокиЧекЛиста.ТолькоПросмотр;
    Элементы.Удалить.Доступность =  Элементы.ПеренестиВыделенныеЧЛВЗаявку.Доступность;
 
КонецПроцедуры


&НаСервере
Функция  НеБитаяСсылка(Задача)
    
    возврат ?(Задача.пустая(), Истина, Задача.ПолучитьОбъект() <> неопределено )
    
КонецФункции


&НаКлиенте
Процедура ЧекЛистыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    
    Отказ = Истина	;
    Стр = объект.ЧекЛисты.Добавить();
    
    Если  Копирование тогда 	
        ЗаполнитьЗначенияСвойств(стр, Элементы.ЧекЛисты.ТекущиеДанные,"Задание,ИДЗадания,ЭтоЗадание");
    КонецЕсли;
    
    Стр.Сотрудник = ТекущийПользователь();
    Стр.Дата = ТекущаяДата();
    Стр.Сотрудник = ТекущийПользователь();
    
    Элементы.ЧекЛисты.ТекущаяСтрока = стр.ПолучитьИдентификатор();
    
КонецПроцедуры

&НаСервере
Функция  СметаСотрудникОбработкаВыбораНаСервере(ВыбранноеЗначение)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	
    |ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
    |ИЗ
    |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
    |ГДЕ
    |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо";
    Запрос.УстановитьПараметр("ФизическоеЛицо",ВыбранноеЗначение.ФизическоеЛицо);	
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
        возврат  ВыборкаДетальныеЗаписи.ТекущаяДолжность
    КонецЕсли;;
    
    Возврат ""
    
КонецФункции


&НаКлиенте
Процедура ЧекЛистыЧасы1ПриИзменении(Элемент)
    
    ОкруглитьДоЧетвертиЧаса( Элементы.ЧекЛисты.ТекущиеДанные.Часы);
    Элементы.ЧекЛисты.ТекущиеДанные.ЧасыКлиенту = Элементы.ЧекЛисты.ТекущиеДанные.Часы;
    Если  не ЗначениеЗаполнено(Элементы.ЧекЛисты.ТекущиеДанные.Дата) тогда
        Элементы.ЧекЛисты.ТекущиеДанные.Дата = ТекущаяДата();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
    
    Стр = объект.ЧекЛисты.Добавить();
    стр.ЭтоЗадание = Ложь;
    стр.стадия = ПредопределенноеЗначение("Справочник._СтадииРазработки.Разработка");
    стр.Статус = ПредопределенноеЗначение("Перечисление._СтатусыЧЛ.Создана");
    Элементы.ЧекЛисты.ТекущаяСтрока = стр.ПолучитьИдентификатор();
    ТекущийЭлемент = Элементы.ЧекЛистыСтадия1;
    ЧекЛистыЭтоЗаданиеПриИзмененииНаСервере(стр.ПолучитьИдентификатор());
    
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыделенныеЧЛВЗаявку(Команда)
    СтрокиКоторыеМожноПеренести = новый Массив;
    для Каждого  стр из Элементы.ЧекЛисты.ВыделенныеСтроки цикл
        Если не ЗначениеЗаполнено(Объект.ЧекЛисты.НайтиПоИдентификатору(стр).КодСтроки) и не ЗначениеЗаполнено(Объект.ЧекЛисты.НайтиПоИдентификатору(стр).НомерЗаписиRM) тогда
            СтрокиКоторыеМожноПеренести.Добавить(стр);
        иначе
            Сообщить("Нельзя перенести строку " + Объект.ЧекЛисты.НайтиПоИдентификатору(стр).НомерСтроки);
        КонецЕсли;
    КонецЦикла;
    
    
    Если СтрокиКоторыеМожноПеренести.Количество() тогда
        СписокАктивныхСтатусов = СписокСтатусовПодбора();
        //мПараметры = новый Структура("отбор",новый Структура("Статус,Проверена",СписокАктивныхСтатусов,Ложь));
        Форма = ОткрытьФорму("Документ._Заявка.Форма.ФормаВыбораНовая",, , , , ,новый ОписаниеОповещения("ПеренестиВыделенныеЧЛВЗаявкуЗавершение",ЭтаФорма,СтрокиКоторыеМожноПеренести));
        Форма.список.Отбор.Элементы.Очистить();
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.список,
        "Статус", СписокАктивныхСтатусов,ВидСравненияКомпоновкиДанных.ВСписке,"Активные заявки",
        Истина,?(РольДоступна1("ПолныеПрава") или  РольДоступна1("_ИзменениеВыполненныхПроверенныхЗаявок") ,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный));
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.список,
        "Проверена", Ложь,ВидСравненияКомпоновкиДанных.Равно, "Не проверена",
        Истина,?(РольДоступна1("ПолныеПрава")или  РольДоступна1("_ИзменениеВыполненныхПроверенныхЗаявок"),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный));
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.список,
        "Контрагент", Объект.Контрагент ,ВидСравненияКомпоновкиДанных.Равно, ,
        Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
        
    КонецЕсли;
    
КонецПроцедуры

&Насервере
Функция СписокСтатусовПодбора()
    
    СписокАктивныхСтатусов = новый СписокЗначений;
    СписокАктивныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.ВРаботе"));
    СписокАктивныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.ПереданоВТестирование"));
    СписокАктивныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.Принят"));
    
    Возврат СписокАктивныхСтатусов;
    
КонецФункции

&НаКлиенте
Процедура ПеренестиВыделенныеЧЛВЗаявкуЗавершение(Зн, СтрокиКоторыеМожноПеренести) экспорт
    
    Если зн = Неопределено тогда
        Возврат
    КонецЕсли;
    Если не  ПеренестиВыделенныеЧЛВЗаявкуНаСервере(Зн,СтрокиКоторыеМожноПеренести) тогда
        Сообщить("не удалось перенести ");
    иначе
        Записать();
        Прочитать();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
функция ПеренестиВыделенныеЧЛВЗаявкуНаСервере(Зн,СтрокиКоторыеМожноПеренести)
    
    Заявка2 = Зн.Получитьобъект();
    
    Для Каждого мИнд из СтрокиКоторыеМожноПеренести Цикл 
        стр = Объект.ЧекЛисты.НайтиПоИдентификатору(мИнд);  
        Нстр = Заявка2.ЧекЛисты.Добавить();
        ЗаполнитьЗначенияСвойств(Нстр,стр);
    КонецЦикла;
    
    попытка
        Заявка2.записать();
        Для Каждого мИнд из СтрокиКоторыеМожноПеренести Цикл 
            стр = Объект.ЧекЛисты.НайтиПоИдентификатору(мИнд);  
            Объект.ЧекЛисты.Удалить(стр);
        КонецЦикла;
    Исключение
        Возврат Ложь
    КонецПопытки;;
    
    Возврат Истина
    
КонецФункции

&НаКлиенте
Процедура ГруппаСтаницаПриСменеСтраницы(Элемент, ТекущаяСтраница)
    
    ОбновитьсписокПодчиненности()
    
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьсписокПодчиненности()
    
    Если Объект.Ссылка.Пустая() тогда 
        возврат
    КонецЕсли;
    Ф = ПолучитьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", Объект.Ссылка),
    ЭтаФорма,
    КлючУникальности,
    Неопределено);
    СвязанныеТД =  Ф.ВернутьТД();
    Элементы.СвязанныеТД.Высота = СвязанныеТД.высотаТаблицы * 2; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    
    стрИД = Неопределено;
    ОбновитьсписокПодчиненности()   ;
    
    МассивСтрокПереноса  = НОВЫЙ Массив;
    Для  Каждого стр из Объект.ЧекЛисты Цикл 
        Если стр.ЭтоЗадание и не стр.Статус = ПредопределенноеЗначение("Перечисление._СтатусыЧЛ.Отменено") и стр.Часы = 0  тогда
            МассивСтрокПереноса.Добавить(стр);   
        КонецЕсли;
    КонецЦикла;
    Если МассивСтрокПереноса.Количество() и объект.Техподдержка и Не НеЗадаватьВопрос
        и СтатусВыполнено() тогда
        Отказ = Истина;
        ПоказатьВопрос(новый ОписаниеОповещения("ПередЗаписьюЗавершение",ЭтаФорма),"Перенести незакрытые задания в новую заявку?",РежимДиалогаВопрос.ДаНет); 
    КонецЕсли;
    
    ОчиститьСообщения();
КонецПроцедуры
 
&НаСервере
Процедура ЧекЛистыЭтоЗаданиеПриИзмененииНаСервере(ТС)
    
    стр = объект.ЧекЛисты.НайтиПоИдентификатору(ТС);
    Если стр.ЭтоЗадание тогда
        Стр.ДатаПланОтветственный = ТекущаяДата() + 60*60;
        Стр.Ответственный = ТекущийПользователь();
        Стр.Дата = Неопределено ;
        Стр.Часы = 0;
    иначе
        Стр.ДатаПланОтветственный = Неопределено;
        Стр.Ответственный = ТекущийПользователь();
        Стр.Сотрудник = ТекущийПользователь();
        Стр.Дата = ТекущаяДата() ;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистыЭтоЗаданиеПриИзменении(Элемент)
    
    Тс = Элементы.ЧекЛисты.ТекущаяСтрока;
    ЧекЛистыЭтоЗаданиеПриИзмененииНаСервере(ТС);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодчиненность(Команда)
    
    ОбновитьсписокПодчиненности();
    
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
    
    Экран = ПолучитьИнформациюЭкрановКлиента()[0];
    Если Экран.Ширина < 1920  тогда 
        ЭтаФорма.Масштаб = 80 ; 
    иначе
        Масштаб = 100;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура НазначенаНаПриИзмененииНаСервере()  Экспорт
    
    Если Объект.НазначенаНа <> объект.Ссылка.НазначенаНа  тогда
        Если стрИД = Неопределено тогда 
            стр = объект.ЧекЛисты.Добавить();
            стрИД = стр.ПолучитьИдентификатор();
        иначе
            стр = Объект.ЧекЛисты.НайтиПоИдентификатору(стрИД);
        КонецЕсли;
        
        Если объект.НазначенаНа.Пустая() тогда 
            объект.Смета.Удалить(стр);
            Возврат;
        КонецЕсли;
        
        стр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
        стр.ЭтоЗадание = Истина;
        стр.ДатаПланОтветственный = ТекущаяДата();
        стр.Задание = объект.Название;
        стр.Сотрудник = объект.НазначенаНа;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура НазначенаНаПриИзменении(Элемент)
    НазначенаНаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура СметаСотрудникПриИзмененииНаСервере(ТС) Экспорт
    
    
    стр = объект.Смета.НайтиПоИдентификатору(ТС);
    стр.Роль = стр.сотрудник.Роль;
    
КонецПроцедуры


&НаКлиенте
Процедура СметаСотрудникПриИзменении(Элемент)
    
    ТС = Элементы.Смета.ТекущаяСтрока;
    СметаСотрудникПриИзмененииНаСервере(ТС);
    
КонецПроцедуры


&НаКлиенте
Процедура Разослать(Команда)
    ОткрытьФорму("Документ._Заявка.Форма.ФормаОтправкиРГ",новый Структура("Список",СписокСотрудников()),ЭтаФорма);
КонецПроцедуры


&Насервере
Функция  СписокСотрудников()
    
    Возврат объект.Смета.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник")
    
КонецФункции

&НаКлиенте
Процедура КомментарииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    
    Если НоваяСтрока тогда
        Элементы.Комментарии.ТекущиеДанные.Дата = ТекущаяДата();
        Элементы.Комментарии.ТекущиеДанные.КонтактноеЛицо = ТекущийПользователь();
        Элементы.Комментарии.ТекущиеДанные.Защищена = Ложь;
        
        //Отказ = Истина  ;
        //
        //стр = объект.Комментарии.Добавить();
        //ЗаполнитьЗначенияСвойств(стр,Элементы.Комментарии.ТекущиеДанные,,"Защищена"); 
        //стр.КонтактноеЛицо = ТекущийПользователь();
        //Элементы.Комментарии.ТекущаяСтрока = стр.ПолучитьИдентификатор();
        
       // ОткрытьВОтдельномОкне();
        //ОткрытьФорму("Документ._Заявка.Форма.ФормаРедактированияОписания", новый Структура("КомментарийHTML",(Элементы.Комментарии.ТекущиеДанные.КомментарийHTML_)),ЭтаФорма);    
        
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Комментарии1КомментарийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомментарииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ОткрытьВОтдельномОкне();
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВОтдельномОкне()
    
    СтандартнаяОбработка = Ложь;
    ТД = Элементы.Комментарии.ТекущиеДанные;
    
    Если тд = Неопределено тогда
        Возврат
    КонецЕсли;
    
    ДанныеКомментария = ?(ТД.КомментарийHTML_= Неопределено,  ТД.Комментарий, ТД.КомментарийHTML_);
    ОткрытьФорму("Документ._Заявка.Форма.ФормаРедактированияОписания", 
    новый Структура("ДанныеКомментария",ДанныеКомментария),ЭтаФорма,,Окно); 
    
КонецПроцедуры

&Насервере
Процедура Оповещения(ТекущийОбъект)
    
    Если Объект.Техподдержка тогда Возврат; КонецЕсли;
    
    //Курсив — символ подчёркивания (_) с каждой стороны.
    //Моноширинный шрифт — три знака апострофа (‘) с каждой стороны.
    //Полужирное начертание — две звёздочки () с каждой стороны.
    
    //фиксим изменения и рассылаем пользователям
    Заявка = ""; 
    
    ТекстСтатус = "";
    Текст = "";
    
    Если не Объект.Ссылка.Пустая() тогда
        Если  объект.Ссылка.Статус <> Объект.Статус тогда
            ТекстСтатус = Символы.ПС + "*Изменился статус *"""  + "`" +  объект.Ссылка.Статус  + "`" +  """ → """  + "`" +  Объект.Статус + """" + "`"  ; 
        КонецЕсли;
        
        Если  СокрЛП(ВРег(объект.Ссылка.Название)) <> СокрЛП(ВРег(объект.Название)) тогда
            ТекстСтатус = ТекстСтатус + Символы.ПС + "*Изменилось название :* """  + "`" +  объект.Ссылка.Название  + "`" +  """ → """  + "`" +  Объект.Название + """" + "`" ; 
        КонецЕсли;
        
        Если  СокрЛП(ВРег(объект.Ссылка.Описание)) <> СокрЛП(ВРег(объект.Описание)) тогда
            ТекстСтатус = ТекстСтатус + Символы.ПС + "*Изменилось описание, старое описание:* " + "`" + Объект.Ссылка.Описание+ "`" ; 
        КонецЕсли;
        
        Для  Каждого стр из объект.Комментарии цикл
            Если не стр.Защищена  тогда 
                Текст = Текст + Символы.ПС + 
                "*Добавлен комментарий:*   " +  
                Символы.ПС +  Символы.Таб + "{`" + Формат(стр.Дата, "ДФ='dd.MM.yy  '") + "` " + "_"+ стр.КонтактноеЛицо + "_"+ 
                Символы.ПС +  Символы.Таб + " " + лев(стр.Комментарий , 200 )+  "}" ; 
            КонецЕсли;
        КонецЦикла;
        Текст = Заявка + ТекстСтатус + Текст; 
    КонецЕсли;
    
    
    Если Текст <> Заявка тогда
        //всей РГ
        ТекущийОбъект.ДополнительныеСвойства.вставить("РассылкаОповещений",Текст);
    КонецЕсли;
    
    
КонецПроцедуры

&НаКлиенте
Процедура КомментарииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    
       
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюПоОсмечиванию(Команда)
    
    _ОбщийМодуль_Клиент.ОткрытьВ1С(ФайлОсмечивания());
    
КонецПроцедуры


&НаСервере
Функция  ФайлОсмечивания()
    
    Возврат Справочники._ВопросыИОтветы.НайтиПоКоду("000000005");
    
КонецФункции

&Насервере 
Функция  ТекПольз()
    
    Возврат ПараметрыСеанса.ТекущийПользователь;
    
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    УстановитьДатуЗапрета();
    
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуЗапрета()
    
    Даты = ДатыЗапретаИзмененияСлужебный.РассчитанныеДатыЗапретаИзменения();
    Если даты.найти(ПараметрыСеанса.ТекущийПользователь)= Неопределено тогда
        ДатаЗапрета = даты.найти(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей).ДатаЗапрета;
    иначе
        Попытка
            ДатаЗапрета = даты.найти(ПараметрыСеанса.ТекущийПользователь).ДатаЗапрета;
        Исключение
            ДатаЗапрета = Дата(1,1,1);
        КонецПопытки;
        
    КонецЕсли;
    
КонецПроцедуры


&НаКлиенте
Процедура ЗаданиеСотруднику(Команда)
    Если Модифицированность тогда
        ПоказатьВопрос(Новый  ОписаниеОповещения("ЗаданиеСотрудникуЗавершение",ЭтаФорма),"Документ будет записан, продолжить?", РежимДиалогаВопрос.ДаНет);    
    иначе
        ЗаданиеСотрудникуЗавершение(КодВозвратаДиалога.Да,"НеЗаписывать")
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеСотрудникуЗавершение(Ответ,ДП) Экспорт 
    
    Если ответ = КодВозвратаДиалога.Да тогда
        Если ДП <> "НеЗаписывать" тогда
            Записан = Записать();
        иначе
            Записан = Истина;
        КонецЕсли;
        Если Записан тогда
            ОткрытьФорму("Обработка._РабочийСтол_Заявки.Форма.СозданиеЗадания", 
            новый Структура("ссылка", Объект.Ссылка), 
            ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция  СтатусВыполнено()
    
    Возврат Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.Выполнена") 
    и не Объект.Ссылка.Статус = ПредопределенноеЗначение("Перечисление._СтатусыЗаявки.Выполнена") 
    
    
КонецФункции

&НаКлиенте
Процедура ПеренестиНеЗакрытыеЗадачи(Команда)
    
    ПеренестиНеЗакрытыеЗадачиНаСервере();
    Прочитать();
    
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиНеЗакрытыеЗадачиЗавершение(Ответ,ДП) Экспорт
    
    Если  Ответ = Неопределено тогда Возврат КонецЕсли;
    ПеренестиНеЗакрытыеЗадачиНаСервере();
    Прочитать();
    
КонецПроцедуры

&НаСервере
Процедура ПеренестиНеЗакрытыеЗадачиНаСервере()
    _ОбщийМодульСервер.ПеренестиНезакрытыеЗадания(объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура КомментарииПриАктивизацииСтроки(Элемент)
    
    КомментарииПриАктивизацииСтрокиНаСервере()
    
КонецПроцедуры


&Насервере
Процедура КомментарииПриАктивизацииСтрокиНаСервере()
    
    ТД = Элементы.Комментарии.ТекущаяСтрока;
    Элементы.Группа18.ТолькоПросмотр = тд = Неопределено ;
    Если тд = Неопределено тогда
        КомментарийHTML.Удалить();
        Возврат
    КонецЕсли;
    ТД = Объект.Комментарии.НайтиПоИдентификатору(ТД);
    ДанныеКомментария = ?(ТД.КомментарийHTML_= Неопределено,  ТД.Комментарий, ТД.КомментарийHTML_);
    _ОбщийМодульСервер.ЗаполнитьHTML(КомментарийHTML, ДанныеКомментария);
    
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВОтдельномОкне(Команда)
    
    
    ОткрытьВОтдельномОкне();
    
КонецПроцедуры

&НаКлиенте
Процедура КомментарийHTMLПриИзменении(Элемент)
    
    стр  = _ОбщийМодульСервер.СохранитьHTML(КомментарийHTML); 
    
    ОбработкаВыбора(стр,"");
    
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсеНевыставленныеЧасыИзЗадач(Команда)
    
    ПеренестиВсеНевыставленныеЧасыИзЗадачНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПеренестиВсеНевыставленныеЧасыИзЗадачНаСервере()
    
    Об = РеквизитФормыВЗначение("Объект");
    Документы._Заявка.ПеренестиВсеНевыставленныеЧасыИзЗадач(Об);
    ЗначениеВРеквизитФормы(об,"Объект");
    Элементы.ПеренестиВсеНевыставленнеыЧасыИзЗадач.Видимость = Ложь;
    Элементы.ЕстьНевыставленные.Видимость           = Ложь;
    Модифицированность = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу(Команда)
    Если Модифицированность тогда
        ПоказатьВопрос(новый ОписаниеОповещения("ОткрытьЗадачуЗавершение",ЭтаФорма),"Записать заявку перед измнением чл ?", РежимДиалогаВопрос.ДаНет);
        
    иначе
        ОткрытьФорму("Задача._ИсполнениеЗадач.Форма.ФормаЗадачи", новый Структура("Ключ,РедактированиеИзЗадачи", Элементы.ЧекЛисты.ТекущиеДанные.Задача, Истина) ,ЭтаФорма,,,,
        новый ОписаниеОповещения("ОткрытьЗадачуЗавершениеЗакрытия",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачуЗавершение(ответ, дп) Экспорт 
    
    Если ответ = КодВозвратаДиалога.да тогда
        Записать();
        ОткрытьФорму("Задача._ИсполнениеЗадач.Форма.ФормаЗадачи", новый Структура("Ключ,РедактированиеИзЗадачи", Элементы.ЧекЛисты.ТекущиеДанные.Задача,Истина) ,ЭтаФорма,,,,
        новый ОписаниеОповещения("ОткрытьЗадачуЗавершениеЗакрытия",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    КонецЕсли;
    
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЗадачуЗавершениеЗакрытия(Ответ, дп) Экспорт 
    
    Прочитать();
    
    
КонецПроцедуры
